'''
Абдуллаев Шахмар ИУ7-14Б
'''

from zach_mod import *

main_text = [
        'Вот)) +++| -+-2+2 /уже около месяца Родион Романович Раскольников не выходил из своей',
        '(+5) * (5+-5) * (5+!+5) комнаты. Он впал в какое-то бесформенное, бессознательное состояние,',
        'когда дни и недели тянутся, как один день, а',
        'hello',
        'один день, как вечность. Он сидел за столом, на котором лежали',
        'разбросанные книги и бумаги, и медленно перелистывал страницы, не',
        'вникая в содержание. Ему было все равно, что он читает философию или романы,',
        'поэзию или научные трактаты. Ему было все равно на все в этом мире. Он ощущал себя как',
        '1--1 а 1 -- 1 а 1 +-1--2 п -1-1 а -1+1 а -1+2',
        'будто оторванным от реальности, погруженным во сне или бреду.'
]

main_text = [
        '1Папаааааа. 2Паапаа.',
        '3Ппаа. 4Па.'
]
main_text = find_and_del(main_text)
